Repository: thierryH91200/THPredicateEditorSwift
Catalog: THPredicateEditorSwift/*.lproj/Predicate.strings
Languages: fr

source: %[Any]@ of the following are true
fr: %[Une]@ des conditions suivantes est vraie

source: %[All]@ of the following are true
fr: %[Toutes]@ les conditions sont vraies

source: %[None]@ of the following are true
fr: %[Aucune]@ des conditions suivantes n'est vraie

source: firstname
fr: nom

# %[firstName]@ %[is]@ %@
source: %1$[firstName]@ %2$[is]@ %3$@
fr: %1$[nom]@ %2$[est]@ %3$@

# %[firstName]@ %[is not]@ %@
source: %1$[firstName]@ %2$[is not]@ %3$@
fr: %1$[nom]@ %2$[n'est pas]@ %3$@

source: lastName
fr: prenom

# %[lastName]@ %[is]@ %@
source: %1$[lastName]@ %2$[is]@ %3$@
fr: %1$[prenom]@ %2$[est]@ %3$@

# %[lastName]@ %[is not]@ %@
source: %1$[lastName]@ %2$[is not]@ %3$@
fr: %1$[prenom]@ %2$[n'est pas]@ %3$@

source: Country
fr: Pays

# %[country]@ %[is]@ %[Mexico]@
source: %1$[country]@ %2$[is]@ %3$[Mexico]@
fr: %1$[Pays]@ %2$[est]@ %3$[Mexique]@

# %[country]@ %[is]@ %[Canada]@
source: %1$[country]@ %2$[is]@ %3$[Canada]@
fr: %1$[Pays]@ %2$[est]@ %3$[Canada]@

# %[country]@ %[is]@ %[Brazil]@
source: %1$[country]@ %2$[is]@ %3$[Brazil]@
fr: %1$[Pays]@ %2$[est]@ %3$[Bresil]@

# %[country]@ %[is]@ %[United States]@
source: %1$[country]@ %2$[is]@ %3$[United States]@
fr: %1$[Pays]@ %2$[est]@ %3$[Etats Unis]@

# %[country]@ %[is not]@ %[Mexico]@
source: %1$[country]@ %2$[is not]@ %3$[Mexico]@
fr: %1$[Pays]@ %2$[n'est past]@ %3$[Mexique]@

# %[country]@ %[is not]@ %[Canada]@
source: %1$[country]@ %2$[is not]@ %3$[Canada]@
fr: %1$[Pays]@ %2$[n'est pas]@ %3$[Canada]@

# %[country]@ %[is not]@ %[Brazil]@
source: %1$[country]@ %2$[is not]@ %3$[Brazil]@
fr: %1$[Pays]@ %2$[n'est pas]@ %3$[Bresil]@

# %[country]@ %[is not]@ %[United States]@
source: %1$[country]@ %2$[is not]@ %3$[United States]@
fr: %1$[Pays]@ %2$[n'est pas]@ %3$[Etats Unis]@

# %[age]@ %[is]@ %@
source: %1$[age]@ %2$[is]@ %3$@
fr: %1$[age]@ %2$[est égal à]@ %3$@

# %[age]@ %[is not]@ %@
source: %1$[age]@ %2$[is not]@ %3$@
fr: %1$[age]@ %2$[n'est pas égal à]@ %3$@

# %[age]@ %[is less than]@ %@
source: %1$[age]@ %2$[is less than]@ %3$@
fr: %1$[age]@ %2$[est plus petit que]@ %3$@

# %[age]@ %[is less than or equal to]@ %@
source: %1$[age]@ %2$[is less than or equal to]@ %3$@
fr: %1$[age]@ %2$[est plus petit ou égal à]@ %3$@

# %[age]@ %[is greater than]@ %@
source: %1$[age]@ %2$[eis greater thane]@ %3$@
fr: %1$[age]@ %2$[est plus grand que]@ %3$@

# %[age]@ %[is greater than or equal to]@ %@
source: %1$[age]@ %2$[is greater than or equal to]@ %3$@
fr: %1$[age]@ %2$[est plus grand ou égal à]@ %3$@

# %[dateOfBirth]@ %[is]@ %@
source: %1$[dateOfBirth]@ %2$[is]@ %3$@
fr: %1$[dateOfBirth]@ %2$[est]@ %3$@

# %[dateOfBirth]@ %[is less than]@ %@
source: %1$[dateOfBirth]@ %2$[is less than]@ %3$@
fr: %1$[dateOfBirth]@ %2$[est plus petite que]@ %3$@

# %[dateOfBirth]@ %[is less than or equal to]@ %@
source: %1$[dateOfBirth]@ %2$[is less than or equal to]@ %3$@
fr: %1$[dateOfBirth]@ %2$[est plus petit ou égal à]@ %3$@

# %[dateOfBirth]@ %[is greater than]@ %@
source: %1$[dateOfBirth]@ %2$[is greater than]@ %3$@
fr: %1$[dateOfBirth]@ %2$[est plus grand que]@ %3$@

# %[dateOfBirth]@ %[is greater than or equal to]@ %@
source: %1$[dateOfBirth]@ %2$[is greater than or equal to]@ %3$@
fr: %1$[dateOfBirth]@ %2$[est plus grand ou égal à]@ %3$@
